app/Controllers/LoginController.php

SELECT *
FROM `users`
WHERE `username` = 'ubeydullah'
 LIMIT 1
---
    public function submit()
    {
        // Formdan gelen verileri alıyoruz
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // UsersModel'ini kullanarak veritabanındaki kullanıcıları kontrol ediyoruz
        $userModel = new UsersModel();
        $user = $userModel->where('username', $username)->first(); // Kullanıcı adı ile arama yapıyoruz