app/Models/BilezikModel.php

public function getBileziklerWithKategori()
{
    return $this->select('bilezikler.*, kategoriler.name as kategori_adi')
                ->join('kategoriler', 'kategoriler.id = bilezikler.kategori_id','left')
                ->findAll();
---
SELECT `bilezikler`.*, `kategoriler`.`name` as `kategori_adi`
FROM `bilezikler`
LEFT JOIN `kategoriler` ON `kategoriler`.`id` = `bilezikler`.`kategori_id`